; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p13---int100n150-m25---int100c200---s313---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level10 level10)
(sum level0 level11 level11)
(sum level0 level17 level17)
(sum level0 level20 level20)
(sum level0 level21 level21)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level10 level11)
(sum level1 level11 level12)
(sum level1 level17 level18)
(sum level1 level20 level21)
(sum level1 level21 level22)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level10 level12)
(sum level2 level11 level13)
(sum level2 level17 level19)
(sum level2 level20 level22)
(sum level2 level21 level23)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level10 level13)
(sum level3 level11 level14)
(sum level3 level17 level20)
(sum level3 level20 level23)
(sum level3 level21 level24)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level10 level14)
(sum level4 level11 level15)
(sum level4 level17 level21)
(sum level4 level20 level24)
(sum level4 level21 level25)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level10 level15)
(sum level5 level11 level16)
(sum level5 level17 level22)
(sum level5 level20 level25)
(sum level5 level21 level26)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level10 level16)
(sum level6 level11 level17)
(sum level6 level17 level23)
(sum level6 level20 level26)
(sum level6 level21 level27)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level10 level17)
(sum level7 level11 level18)
(sum level7 level17 level24)
(sum level7 level20 level27)
(sum level7 level21 level28)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level10 level18)
(sum level8 level11 level19)
(sum level8 level17 level25)
(sum level8 level20 level28)
(sum level8 level21 level29)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level10 level19)
(sum level9 level11 level20)
(sum level9 level17 level26)
(sum level9 level20 level29)
(sum level9 level21 level30)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level10 level20)
(sum level10 level11 level21)
(sum level10 level17 level27)
(sum level10 level20 level30)
(sum level10 level21 level31)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level10 level21)
(sum level11 level11 level22)
(sum level11 level17 level28)
(sum level11 level20 level31)
(sum level11 level21 level32)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level10 level22)
(sum level12 level11 level23)
(sum level12 level17 level29)
(sum level12 level20 level32)
(sum level12 level21 level33)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level10 level23)
(sum level13 level11 level24)
(sum level13 level17 level30)
(sum level13 level20 level33)
(sum level13 level21 level34)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level10 level24)
(sum level14 level11 level25)
(sum level14 level17 level31)
(sum level14 level20 level34)
(sum level14 level21 level35)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level10 level25)
(sum level15 level11 level26)
(sum level15 level17 level32)
(sum level15 level20 level35)
(sum level15 level21 level36)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level10 level26)
(sum level16 level11 level27)
(sum level16 level17 level33)
(sum level16 level20 level36)
(sum level16 level21 level37)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level10 level27)
(sum level17 level11 level28)
(sum level17 level17 level34)
(sum level17 level20 level37)
(sum level17 level21 level38)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level10 level28)
(sum level18 level11 level29)
(sum level18 level17 level35)
(sum level18 level20 level38)
(sum level18 level21 level39)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level10 level29)
(sum level19 level11 level30)
(sum level19 level17 level36)
(sum level19 level20 level39)
(sum level19 level21 level40)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level10 level30)
(sum level20 level11 level31)
(sum level20 level17 level37)
(sum level20 level20 level40)
(sum level20 level21 level41)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level10 level31)
(sum level21 level11 level32)
(sum level21 level17 level38)
(sum level21 level20 level41)
(sum level21 level21 level42)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level10 level32)
(sum level22 level11 level33)
(sum level22 level17 level39)
(sum level22 level20 level42)
(sum level22 level21 level43)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level10 level33)
(sum level23 level11 level34)
(sum level23 level17 level40)
(sum level23 level20 level43)
(sum level23 level21 level44)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level10 level34)
(sum level24 level11 level35)
(sum level24 level17 level41)
(sum level24 level20 level44)
(sum level24 level21 level45)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level10 level35)
(sum level25 level11 level36)
(sum level25 level17 level42)
(sum level25 level20 level45)
(sum level25 level21 level46)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level10 level36)
(sum level26 level11 level37)
(sum level26 level17 level43)
(sum level26 level20 level46)
(sum level26 level21 level47)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level10 level37)
(sum level27 level11 level38)
(sum level27 level17 level44)
(sum level27 level20 level47)
(sum level27 level21 level48)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level10 level38)
(sum level28 level11 level39)
(sum level28 level17 level45)
(sum level28 level20 level48)
(sum level28 level21 level49)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level10 level39)
(sum level29 level11 level40)
(sum level29 level17 level46)
(sum level29 level20 level49)
(sum level29 level21 level50)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level10 level40)
(sum level30 level11 level41)
(sum level30 level17 level47)
(sum level30 level20 level50)
(sum level30 level21 level51)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level10 level41)
(sum level31 level11 level42)
(sum level31 level17 level48)
(sum level31 level20 level51)
(sum level31 level21 level52)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level10 level42)
(sum level32 level11 level43)
(sum level32 level17 level49)
(sum level32 level20 level52)
(sum level32 level21 level53)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level10 level43)
(sum level33 level11 level44)
(sum level33 level17 level50)
(sum level33 level20 level53)
(sum level33 level21 level54)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level10 level44)
(sum level34 level11 level45)
(sum level34 level17 level51)
(sum level34 level20 level54)
(sum level34 level21 level55)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level10 level45)
(sum level35 level11 level46)
(sum level35 level17 level52)
(sum level35 level20 level55)
(sum level35 level21 level56)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level10 level46)
(sum level36 level11 level47)
(sum level36 level17 level53)
(sum level36 level20 level56)
(sum level36 level21 level57)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level10 level47)
(sum level37 level11 level48)
(sum level37 level17 level54)
(sum level37 level20 level57)
(sum level37 level21 level58)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level10 level48)
(sum level38 level11 level49)
(sum level38 level17 level55)
(sum level38 level20 level58)
(sum level38 level21 level59)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level10 level49)
(sum level39 level11 level50)
(sum level39 level17 level56)
(sum level39 level20 level59)
(sum level39 level21 level60)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level10 level50)
(sum level40 level11 level51)
(sum level40 level17 level57)
(sum level40 level20 level60)
(sum level40 level21 level61)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level10 level51)
(sum level41 level11 level52)
(sum level41 level17 level58)
(sum level41 level20 level61)
(sum level41 level21 level62)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level10 level52)
(sum level42 level11 level53)
(sum level42 level17 level59)
(sum level42 level20 level62)
(sum level42 level21 level63)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level10 level53)
(sum level43 level11 level54)
(sum level43 level17 level60)
(sum level43 level20 level63)
(sum level43 level21 level64)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level10 level54)
(sum level44 level11 level55)
(sum level44 level17 level61)
(sum level44 level20 level64)
(sum level44 level21 level65)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level10 level55)
(sum level45 level11 level56)
(sum level45 level17 level62)
(sum level45 level20 level65)
(sum level45 level21 level66)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level10 level56)
(sum level46 level11 level57)
(sum level46 level17 level63)
(sum level46 level20 level66)
(sum level46 level21 level67)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level10 level57)
(sum level47 level11 level58)
(sum level47 level17 level64)
(sum level47 level20 level67)
(sum level47 level21 level68)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level10 level58)
(sum level48 level11 level59)
(sum level48 level17 level65)
(sum level48 level20 level68)
(sum level48 level21 level69)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level10 level59)
(sum level49 level11 level60)
(sum level49 level17 level66)
(sum level49 level20 level69)
(sum level49 level21 level70)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level10 level60)
(sum level50 level11 level61)
(sum level50 level17 level67)
(sum level50 level20 level70)
(sum level50 level21 level71)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level51 level10 level61)
(sum level51 level11 level62)
(sum level51 level17 level68)
(sum level51 level20 level71)
(sum level51 level21 level72)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level52 level10 level62)
(sum level52 level11 level63)
(sum level52 level17 level69)
(sum level52 level20 level72)
(sum level52 level21 level73)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level53 level10 level63)
(sum level53 level11 level64)
(sum level53 level17 level70)
(sum level53 level20 level73)
(sum level53 level21 level74)
(sum level54 level4 level58)
(sum level54 level5 level59)
(sum level54 level10 level64)
(sum level54 level11 level65)
(sum level54 level17 level71)
(sum level54 level20 level74)
(sum level54 level21 level75)
(sum level55 level4 level59)
(sum level55 level5 level60)
(sum level55 level10 level65)
(sum level55 level11 level66)
(sum level55 level17 level72)
(sum level55 level20 level75)
(sum level55 level21 level76)
(sum level56 level4 level60)
(sum level56 level5 level61)
(sum level56 level10 level66)
(sum level56 level11 level67)
(sum level56 level17 level73)
(sum level56 level20 level76)
(sum level56 level21 level77)
(sum level57 level4 level61)
(sum level57 level5 level62)
(sum level57 level10 level67)
(sum level57 level11 level68)
(sum level57 level17 level74)
(sum level57 level20 level77)
(sum level57 level21 level78)
(sum level58 level4 level62)
(sum level58 level5 level63)
(sum level58 level10 level68)
(sum level58 level11 level69)
(sum level58 level17 level75)
(sum level58 level20 level78)
(sum level58 level21 level79)
(sum level59 level4 level63)
(sum level59 level5 level64)
(sum level59 level10 level69)
(sum level59 level11 level70)
(sum level59 level17 level76)
(sum level59 level20 level79)
(sum level59 level21 level80)
(sum level60 level4 level64)
(sum level60 level5 level65)
(sum level60 level10 level70)
(sum level60 level11 level71)
(sum level60 level17 level77)
(sum level60 level20 level80)
(sum level60 level21 level81)
(sum level61 level4 level65)
(sum level61 level5 level66)
(sum level61 level10 level71)
(sum level61 level11 level72)
(sum level61 level17 level78)
(sum level61 level20 level81)
(sum level61 level21 level82)
(sum level62 level4 level66)
(sum level62 level5 level67)
(sum level62 level10 level72)
(sum level62 level11 level73)
(sum level62 level17 level79)
(sum level62 level20 level82)
(sum level62 level21 level83)
(sum level63 level4 level67)
(sum level63 level5 level68)
(sum level63 level10 level73)
(sum level63 level11 level74)
(sum level63 level17 level80)
(sum level63 level20 level83)
(sum level63 level21 level84)
(sum level64 level4 level68)
(sum level64 level5 level69)
(sum level64 level10 level74)
(sum level64 level11 level75)
(sum level64 level17 level81)
(sum level64 level20 level84)
(sum level64 level21 level85)
(sum level65 level4 level69)
(sum level65 level5 level70)
(sum level65 level10 level75)
(sum level65 level11 level76)
(sum level65 level17 level82)
(sum level65 level20 level85)
(sum level65 level21 level86)
(sum level66 level4 level70)
(sum level66 level5 level71)
(sum level66 level10 level76)
(sum level66 level11 level77)
(sum level66 level17 level83)
(sum level66 level20 level86)
(sum level66 level21 level87)
(sum level67 level4 level71)
(sum level67 level5 level72)
(sum level67 level10 level77)
(sum level67 level11 level78)
(sum level67 level17 level84)
(sum level67 level20 level87)
(sum level67 level21 level88)
(sum level68 level4 level72)
(sum level68 level5 level73)
(sum level68 level10 level78)
(sum level68 level11 level79)
(sum level68 level17 level85)
(sum level68 level20 level88)
(sum level68 level21 level89)
(sum level69 level4 level73)
(sum level69 level5 level74)
(sum level69 level10 level79)
(sum level69 level11 level80)
(sum level69 level17 level86)
(sum level69 level20 level89)
(sum level69 level21 level90)
(sum level70 level4 level74)
(sum level70 level5 level75)
(sum level70 level10 level80)
(sum level70 level11 level81)
(sum level70 level17 level87)
(sum level70 level20 level90)
(sum level70 level21 level91)
(sum level71 level4 level75)
(sum level71 level5 level76)
(sum level71 level10 level81)
(sum level71 level11 level82)
(sum level71 level17 level88)
(sum level71 level20 level91)
(sum level71 level21 level92)
(sum level72 level4 level76)
(sum level72 level5 level77)
(sum level72 level10 level82)
(sum level72 level11 level83)
(sum level72 level17 level89)
(sum level72 level20 level92)
(sum level72 level21 level93)
(sum level73 level4 level77)
(sum level73 level5 level78)
(sum level73 level10 level83)
(sum level73 level11 level84)
(sum level73 level17 level90)
(sum level73 level20 level93)
(sum level73 level21 level94)
(sum level74 level4 level78)
(sum level74 level5 level79)
(sum level74 level10 level84)
(sum level74 level11 level85)
(sum level74 level17 level91)
(sum level74 level20 level94)
(sum level74 level21 level95)
(sum level75 level4 level79)
(sum level75 level5 level80)
(sum level75 level10 level85)
(sum level75 level11 level86)
(sum level75 level17 level92)
(sum level75 level20 level95)
(sum level75 level21 level96)
(sum level76 level4 level80)
(sum level76 level5 level81)
(sum level76 level10 level86)
(sum level76 level11 level87)
(sum level76 level17 level93)
(sum level76 level20 level96)
(sum level76 level21 level97)
(sum level77 level4 level81)
(sum level77 level5 level82)
(sum level77 level10 level87)
(sum level77 level11 level88)
(sum level77 level17 level94)
(sum level77 level20 level97)
(sum level77 level21 level98)
(sum level78 level4 level82)
(sum level78 level5 level83)
(sum level78 level10 level88)
(sum level78 level11 level89)
(sum level78 level17 level95)
(sum level78 level20 level98)
(sum level78 level21 level99)
(sum level79 level4 level83)
(sum level79 level5 level84)
(sum level79 level10 level89)
(sum level79 level11 level90)
(sum level79 level17 level96)
(sum level79 level20 level99)
(sum level79 level21 level100)
(sum level80 level4 level84)
(sum level80 level5 level85)
(sum level80 level10 level90)
(sum level80 level11 level91)
(sum level80 level17 level97)
(sum level80 level20 level100)
(sum level80 level21 level101)
(sum level81 level4 level85)
(sum level81 level5 level86)
(sum level81 level10 level91)
(sum level81 level11 level92)
(sum level81 level17 level98)
(sum level81 level20 level101)
(sum level81 level21 level102)
(sum level82 level4 level86)
(sum level82 level5 level87)
(sum level82 level10 level92)
(sum level82 level11 level93)
(sum level82 level17 level99)
(sum level82 level20 level102)
(sum level82 level21 level103)
(sum level83 level4 level87)
(sum level83 level5 level88)
(sum level83 level10 level93)
(sum level83 level11 level94)
(sum level83 level17 level100)
(sum level83 level20 level103)
(sum level83 level21 level104)
(sum level84 level4 level88)
(sum level84 level5 level89)
(sum level84 level10 level94)
(sum level84 level11 level95)
(sum level84 level17 level101)
(sum level84 level20 level104)
(sum level84 level21 level105)
(sum level85 level4 level89)
(sum level85 level5 level90)
(sum level85 level10 level95)
(sum level85 level11 level96)
(sum level85 level17 level102)
(sum level85 level20 level105)
(sum level85 level21 level106)
(sum level86 level4 level90)
(sum level86 level5 level91)
(sum level86 level10 level96)
(sum level86 level11 level97)
(sum level86 level17 level103)
(sum level86 level20 level106)
(sum level86 level21 level107)
(sum level87 level4 level91)
(sum level87 level5 level92)
(sum level87 level10 level97)
(sum level87 level11 level98)
(sum level87 level17 level104)
(sum level87 level20 level107)
(sum level87 level21 level108)
(sum level88 level4 level92)
(sum level88 level5 level93)
(sum level88 level10 level98)
(sum level88 level11 level99)
(sum level88 level17 level105)
(sum level88 level20 level108)
(sum level88 level21 level109)
(sum level89 level4 level93)
(sum level89 level5 level94)
(sum level89 level10 level99)
(sum level89 level11 level100)
(sum level89 level17 level106)
(sum level89 level20 level109)
(sum level89 level21 level110)
(sum level90 level4 level94)
(sum level90 level5 level95)
(sum level90 level10 level100)
(sum level90 level11 level101)
(sum level90 level17 level107)
(sum level90 level20 level110)
(sum level90 level21 level111)
(sum level91 level4 level95)
(sum level91 level5 level96)
(sum level91 level10 level101)
(sum level91 level11 level102)
(sum level91 level17 level108)
(sum level91 level20 level111)
(sum level91 level21 level112)
(sum level92 level4 level96)
(sum level92 level5 level97)
(sum level92 level10 level102)
(sum level92 level11 level103)
(sum level92 level17 level109)
(sum level92 level20 level112)
(sum level92 level21 level113)
(sum level93 level4 level97)
(sum level93 level5 level98)
(sum level93 level10 level103)
(sum level93 level11 level104)
(sum level93 level17 level110)
(sum level93 level20 level113)
(sum level93 level21 level114)
(sum level94 level4 level98)
(sum level94 level5 level99)
(sum level94 level10 level104)
(sum level94 level11 level105)
(sum level94 level17 level111)
(sum level94 level20 level114)
(sum level94 level21 level115)
(sum level95 level4 level99)
(sum level95 level5 level100)
(sum level95 level10 level105)
(sum level95 level11 level106)
(sum level95 level17 level112)
(sum level95 level20 level115)
(sum level95 level21 level116)
(sum level96 level4 level100)
(sum level96 level5 level101)
(sum level96 level10 level106)
(sum level96 level11 level107)
(sum level96 level17 level113)
(sum level96 level20 level116)
(sum level96 level21 level117)
(sum level97 level4 level101)
(sum level97 level5 level102)
(sum level97 level10 level107)
(sum level97 level11 level108)
(sum level97 level17 level114)
(sum level97 level20 level117)
(sum level97 level21 level118)
(sum level98 level4 level102)
(sum level98 level5 level103)
(sum level98 level10 level108)
(sum level98 level11 level109)
(sum level98 level17 level115)
(sum level98 level20 level118)
(sum level98 level21 level119)
(sum level99 level4 level103)
(sum level99 level5 level104)
(sum level99 level10 level109)
(sum level99 level11 level110)
(sum level99 level17 level116)
(sum level99 level20 level119)
(sum level99 level21 level120)
(sum level100 level4 level104)
(sum level100 level5 level105)
(sum level100 level10 level110)
(sum level100 level11 level111)
(sum level100 level17 level117)
(sum level100 level20 level120)
(sum level101 level4 level105)
(sum level101 level5 level106)
(sum level101 level10 level111)
(sum level101 level11 level112)
(sum level101 level17 level118)
(sum level102 level4 level106)
(sum level102 level5 level107)
(sum level102 level10 level112)
(sum level102 level11 level113)
(sum level102 level17 level119)
(sum level103 level4 level107)
(sum level103 level5 level108)
(sum level103 level10 level113)
(sum level103 level11 level114)
(sum level103 level17 level120)
(sum level104 level4 level108)
(sum level104 level5 level109)
(sum level104 level10 level114)
(sum level104 level11 level115)
(sum level105 level4 level109)
(sum level105 level5 level110)
(sum level105 level10 level115)
(sum level105 level11 level116)
(sum level106 level4 level110)
(sum level106 level5 level111)
(sum level106 level10 level116)
(sum level106 level11 level117)
(sum level107 level4 level111)
(sum level107 level5 level112)
(sum level107 level10 level117)
(sum level107 level11 level118)
(sum level108 level4 level112)
(sum level108 level5 level113)
(sum level108 level10 level118)
(sum level108 level11 level119)
(sum level109 level4 level113)
(sum level109 level5 level114)
(sum level109 level10 level119)
(sum level109 level11 level120)
(sum level110 level4 level114)
(sum level110 level5 level115)
(sum level110 level10 level120)
(sum level111 level4 level115)
(sum level111 level5 level116)
(sum level112 level4 level116)
(sum level112 level5 level117)
(sum level113 level4 level117)
(sum level113 level5 level118)
(sum level114 level4 level118)
(sum level114 level5 level119)
(sum level115 level4 level119)
(sum level115 level5 level120)
(sum level116 level4 level120)

(connected l0 l1)
(fuelcost level5 l0 l1)
(connected l0 l2)
(fuelcost level21 l0 l2)
(connected l0 l3)
(fuelcost level20 l0 l3)
(connected l1 l0)
(fuelcost level5 l1 l0)
(connected l1 l3)
(fuelcost level10 l1 l3)
(connected l1 l4)
(fuelcost level11 l1 l4)
(connected l2 l0)
(fuelcost level21 l2 l0)
(connected l2 l3)
(fuelcost level4 l2 l3)
(connected l3 l0)
(fuelcost level20 l3 l0)
(connected l3 l1)
(fuelcost level10 l3 l1)
(connected l3 l2)
(fuelcost level4 l3 l2)
(connected l3 l4)
(fuelcost level17 l3 l4)
(connected l4 l1)
(fuelcost level11 l4 l1)
(connected l4 l3)
(fuelcost level17 l4 l3)

(at t0 l2)
(fuel t0 level120)
(= (total-cost) 0)

(at p0 l4)
(at p1 l4)
(at p2 l0)
(at p3 l3)
(at p4 l4)
(at p5 l0)
(at p6 l1)
(at p7 l0)
(at p8 l4)
(at p9 l1)
(at p10 l1)
(at p11 l0)
(at p12 l1)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l1)
(at p3 l2)
(at p4 l3)
(at p5 l3)
(at p6 l3)
(at p7 l4)
(at p8 l1)
(at p9 l3)
(at p10 l0)
(at p11 l4)
(at p12 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l2 l0 level99 level21 level120)
   deleted: (at t0 l2) (fuel t0 level120)
   added: (at t0 l0) (fuel t0 level99)
   goals met: 0 of 13
2. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 0 of 13
3. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 13
4. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 13
5. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 0 of 13
6. (drive t0 l0 l1 level94 level5 level99)
   deleted: (at t0 l0) (fuel t0 level99)
   added: (at t0 l1) (fuel t0 level94)
   goals met: 0 of 13
7. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 1 of 13
8. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 1 of 13
9. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 1 of 13
10. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 1 of 13
11. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 1 of 13
12. (drive t0 l1 l4 level83 level11 level94)
   deleted: (at t0 l1) (fuel t0 level94)
   added: (at t0 l4) (fuel t0 level83)
   goals met: 1 of 13
13. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 2 of 13
14. (unload p11 t0 l4)
   deleted: (in p11 t0)
   added: (at p11 l4)
   goals met: 3 of 13
15. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 3 of 13
16. (load p4 t0 l4)
   deleted: (at p4 l4)
   added: (in p4 t0)
   goals met: 3 of 13
17. (load p1 t0 l4)
   deleted: (at p1 l4)
   added: (in p1 t0)
   goals met: 3 of 13
18. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 3 of 13
19. (drive t0 l4 l1 level72 level11 level83)
   deleted: (at t0 l4) (fuel t0 level83)
   added: (at t0 l1) (fuel t0 level72)
   goals met: 3 of 13
20. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 4 of 13
21. (drive t0 l1 l0 level67 level5 level72)
   deleted: (at t0 l1) (fuel t0 level72)
   added: (at t0 l0) (fuel t0 level67)
   goals met: 4 of 13
22. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 5 of 13
23. (drive t0 l0 l3 level47 level20 level67)
   deleted: (at t0 l0) (fuel t0 level67)
   added: (at t0 l3) (fuel t0 level47)
   goals met: 5 of 13
24. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 5 of 13
25. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 6 of 13
26. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 7 of 13
27. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 8 of 13
28. (unload p9 t0 l3)
   deleted: (in p9 t0)
   added: (at p9 l3)
   goals met: 9 of 13
29. (drive t0 l3 l2 level43 level4 level47)
   deleted: (at t0 l3) (fuel t0 level47)
   added: (at t0 l2) (fuel t0 level43)
   goals met: 9 of 13
30. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 10 of 13
31. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 11 of 13
32. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 12 of 13
33. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 13 of 13
